app/controllers/pages_controller.rb

  def home
		 @tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"