app/controllers/tournaments_controller.rb

  def index
    @tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"

  def create
    @tournament = Tournament.new(tournament_params)
    @bracket = @tournament.brackets.build(params[:bracket])
    if @tournament.save
---
INSERT INTO "tournaments" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-03 00:05:49.875701"], ["description", "Hello this is a battle!"], ["title", "Battle of Yevol"], ["updated_at", "2014-10-03 00:05:49.875701"]]

  def update
    if @tournament.update(tournament_params)
---
UPDATE "tournaments" SET "description" = ?, "updated_at" = ? WHERE "tournaments"."id" = 1  [["description", "Epic 1v1 EVE Online Battle!"], ["updated_at", "2014-10-06 19:34:06.959223"]]

  def destroy
    @tournament.destroy
---
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 1]]

    def set_tournament
      @tournament = Tournament.find(params[:id])
---
SELECT  "tournaments".* FROM "tournaments"  WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]